/*
再一次向 现实宣战后 从头来过
再一次向 未来朝圣后 从头来过
*/
#include <bits/stdc++.h>
using namespace std;

int main()
{
//	freopen("expand.in","r",stdin);
//	freopen("expand.out","w",stdout);
//freopen("expand.in","r",stdin);
//freopen("expand.out","w",stdout);
	//很显然上面是钓鱼吸引你进来的（
	//这是个表白贴
	//最下面还有我的心得
	
	cout << "I LOVE U,Luo Tianyi!";
	
	
	return 0;
	
}
/*
现在是12:16，距离考试结束还有大半个小时
能拿的分都拿了，所以来写个总结
T1很简单，半小时切了，然后看来看去就T4明白点，但是还是只拿了特殊性质
T2应该是图论，不会，依然只拿了特殊性质，T3不会
本来想玩会儿扫雷的，被监考老师制止了
今年已经高二了，迫于校方与家长的压力，今年没省一就要AFO了，目前估分136，兴许能卡线过
拿了省一我就硬气点，坚持学下去，参加省选
我学OI本就不为什么名利，全是靠爱发电，若没有外力逼迫，学成啥样我都会学下去
这次比赛的精神动力有二，一个是天依
这段时间在洛谷上认识了很多混中V圈的，真得很开心，长这么大第一次找到同好
其二则是有了一个喜欢的女生
力了个flag，拿了省一就去表白
希望，我能成功吧
*/