#include <bits/stdc++.h>
#define rep(i, l, r) for(int i=l, _=r; i<=_; ++i)
using namespace std;
typedef long long ll;
const int mN=3e3+9;
int n, m;
char a[mN][mN], mn[mN];

int main() {
	freopen("dict.in", "r", stdin);
	freopen("dict.out", "w", stdout);

	scanf("%d%d", &n, &m);
	mn[1]=127;
	rep(i, 1, n) {
		char c, *s=a[i];
		scanf("\n%s", s+1);
		sort(s+1, s+m+1);
		rep(j, 1, m) {
			c=s[m-j+1];
			if(c==mn[j]) continue;
			if(c<mn[j]) {
				rep(j, 1, m) {
					mn[j]=s[m-j+1];
				}
			}
			break;
		}
	}
	rep(i, 1, n) {
		char *s=a[i];
		bool suc=1;
		rep(j, 1, m) if(s[j]!=mn[j]) {
			if(mn[j]<s[j]) {
				suc=0;
			}
			break;
		}
		putchar(48|suc);
	}
	return 0;
}

/*
8:30 ~ 8:54
这次只花了 24 分钟，真好。
- n=1
《水经》云：“彭蠡之口有石钟山焉。”郦元以为下临深潭，微风鼓浪，水石相搏，声如洪钟。是说也，人常疑之。今以钟磬置水中，虽大风浪不能鸣也，而况石乎？至唐李渤始访其遗踪，得二石于潭上，扣而聆之，南声含胡，北音清越，桴止响腾，余韵徐歇。自以为得之矣。然是说也，余尤疑之。石之铿然有声者，所在皆是也，而此独以钟名，何哉？
元丰七年六月丁丑，余自齐安舟行适临汝，而长子迈将赴饶之德兴尉，送之至湖口，因得观所谓石钟者。寺僧使小童持斧，于乱石间择其一二扣之，硿硿焉，余固笑而不信也。至暮夜月明，独与迈乘小舟，至绝壁下。大石侧立千尺，如猛兽奇鬼，森然欲搏人。而山上栖鹘，闻人声亦惊起，磔磔云霄间。又有若老人咳且笑于山谷中者，或曰此鹳鹤也。余方心动欲还，而大声发于水上，噌吰如钟鼓不绝，舟人大恐。徐而察之，则山下皆石穴罅，不知其浅深，微波入焉，涵澹澎湃而为此也。舟回至两山间，将入港口，有大石当中流，可坐百人，空中而多窍，与风水相吞吐，有窾坎镗嗒之声，与向之噌吰者响应，如乐作焉。因笑谓迈曰：“汝识之乎？噌吰者，周景王之无射也，窾坎镗嗒者，魏庄子之歌钟也。古之人不余欺也！”
事不目见耳闻，而臆断其有无，可乎？郦元之所见闻，殆与余同，而言之不详。士大夫终不肯以小舟夜泊绝壁之下，故不能知，而渔工水师虽知而不能言，此世所以不传也。而陋者乃以斧斤考击而求之，自以为得其实。余是以记之，盖叹郦元之简，而笑李渤之陋也。

臣闻求木之长者，必固其根本；欲流之远者，必浚其泉源；思国之安者，必积其德义。源不深而望流之远，根不固而求木之长，德不厚而思国之理，臣虽下愚，知其不可，而况于明哲乎！人君当思神器之重，居域中之大，将崇极天之峻，永保无疆之休。不念居安思危，戒奢以俭，德不处其厚，情不胜其欲，斯亦伐根以求木茂，塞源而欲流长者也。
凡百元首，承天景命，莫不殷忧而道著，功成而德衰。有善始者实繁，能克终者盖寡。岂取之易而守之难乎？昔取之而有余，今守之而不足，何也？夫在殷忧，必竭诚以待下，既得志，则纵情以傲物。竭诚则胡越为一体，傲物则骨肉为行路。虽董之以严刑，镇之以威怒，终苟免而不怀仁，貌恭而不心服。怨不在大，可畏唯人；载舟覆舟，所宜深慎。奔车朽索，其可忽乎！
君人者，诚能见可欲则思知足以自戒，将有作则思知止以安人；念高危则思谦冲而自牧，惧满溢则思江海下百川；乐盘游则思三驱以为度，忧懈怠则思慎始而敬终；虑壅闭则思虚心以纳下，想谗邪则思正身以黜恶；恩所加则思无因喜以谬赏，罚所及则思无因怒而滥刑。总此十思，弘兹九德，简能而任之，择善而从之，则勇者竭其力，知者诚其意，仁者播其惠，信者效其忠，文武争驰，在君无事，可以尽豫游之乐，可以养松乔之寿，鸣琴垂拱，不言而化。何必劳神苦思，代下司职，役聪明之耳目，亏无为之大道哉！
*/